import { Pipe, PipeTransform } from '@angular/core';
import { DatePipe } from '@angular/common';

export enum DateFormat {
  Date = 'yyyy-MM-dd',
  DateHour = 'yyyy-MM-dd HH',
  DateTime = 'yyyy-MM-dd HH:mm',
}

export enum MapKeyType {
  String,
  Number,
  Boolean
}

export const MapSet = {
  fireLevel: {
    1: '轻危险级',
    2: '中危险级',
    3: '严重危险级',
    4: '仓库危险级',
  },

  tankType: {
    1: '常压储罐',
    2: '低压储罐',
    3: '压力储罐',
    4: '全压力式储罐',
    5: '半冷冻式、全冷冻式储罐',
    6: '气柜',
  },
  // 储罐形式
  tankForm: {
    1: '立式',
    2: '卧式',
    3: '球形',
  },
  // 储罐材质
  tankMate: {
    1: '碳钢',
    2: '不锈钢',
    3: '有色金属',
    4: '聚乙烯',
    5: '聚丙烯',
    6: '玻璃钢',
    7: '陶瓷',
    8: '橡胶',
    99: '其他',
  },
  // 储罐结构
  tankStructure: {
    1: '拱顶式',
    2: '浮顶式',
    3: '内浮顶',
    4: '卧式',
  },
  // 设备类型
  equipmentType: {
    1: '常压储罐',
    2: '低压储罐',
    3: '压力储罐',
    4: '全压力式储罐',
    5: '半冷冻式、全冷冻式储罐',
    6: '气柜',
    7: '库区',
  },

  // 库房形式
  roomForm: {
    1: '封闭式',
    2: '半封闭式',
    3: '露天',
  },
  // 监测预警数据所有枚举
  monitoringDataType: {
    1: '罐内介质温度',
    2: '罐内介质压力',
    3: '罐内介质液位',
    4: '罐内可燃气体浓度',
    5: '罐内有毒气体浓度',
    6: '可燃气体浓度',
    7: '有毒气体浓度',
    8: '库房内温度',
    9: '库房内湿度',
    10: '气柜柜容',
    11: '气柜压力',
    12: '气柜周边可燃气体浓度',
    13: '气柜周边有毒气体浓度',
  },

  // 常压储罐
  atmosphericPressureType: {
    3: '罐内介质液位',
    1: '罐内介质温度',
    4: '罐内可燃气体浓度',
    5: '罐内有毒气体浓度',
  },

  // 低压储罐
  lowPressureType: {
    3: '罐内介质液位',
    2: '罐内介质压力',
    1: '罐内介质温度',
    4: '罐内可燃气体浓度',
    5: '罐内有毒气体浓度',
  },

  // 压力储罐
  pressureType: {
    3: '罐内介质液位',
    2: '罐内介质压力',
    1: '罐内介质温度',
    4: '罐内可燃气体浓度',
    5: '罐内有毒气体浓度',
  },

  // 全压力式储罐
  fullPressureTankType: {
    3: '罐内介质液位',
    2: '罐内介质压力',
    1: '罐内介质温度',
    4: '罐内可燃气体浓度',
    5: '罐内有毒气体浓度',
  },

  // 半冷冻式、全冷冻式储罐
  freezingTankType: {
    3: '罐内介质液位',
    2: '罐内介质压力',
    1: '罐内介质温度',
    4: '罐内可燃气体浓度',
    5: '罐内有毒气体浓度',
  },


  // 半冷冻式、全冷冻式储罐
  gasTankType: {
    10: '气柜柜容',
    11: '气柜压力',
    12: '气柜周边可燃气体浓度',
    13: '气柜周边有毒气体浓度',
  },

  // 库区
  reservoirAreaType: {
    6: '可燃气体浓度',
    7: '有毒气体浓度',
    8: '库房内温度',
    9: '库房内湿度',
  },

  // 有无
  hasOrNoType: {
    false: '无',
    true: '有',
  },

  // 是否
  isOrNoType: {
    false: '否',
    true: '是',
  },

  // 是否构成
  isDangerSourceType: {
    false: '不构成',
    true: '构成',
  },

  // 危险源类型
  dangerSourceType: {
    1: '储罐',
    2: '高危工艺',
    3: '可燃气体浓度',
    4: '有毒气体浓度',
  },

  // 18种高危工艺
  processType: {
    1: '光气及光气化工艺',
    2: '电解工艺（氯碱）',
    3: '氯化工艺',
    4: '硝化工艺',
    5: '合成氨工艺',
    6: '裂解（裂化）工艺',
    7: '氟化工艺',
    8: '加氢工艺',
    9: '重氮化工艺',
    10: '氧化工艺',
    11: '过氧化工艺',
    12: '氨基化工艺',
    13: '磺化工艺',
    14: '聚合工艺',
    15: '烷基化工艺',
    16: '新型煤化工工艺',
    17: '电石生产工艺',
    18: '偶氮化工艺',
  },

  // 光气及光气化工艺
  phosgeneProcess: {
    1: '反应釜温度',
    2: '反应釜压力',
    3: '反应物质的配料比',
    4: '光气进料速度',
    5: '冷却介质温度',
    6: '冷却介质流量',
    7: '一氧化碳含水量',
    8: '氯气含水量',
    9: '光气',
    10: '氯气',
    11: '一氧化碳',
    12: '反应釜温度联锁',
    13: '反应釜压力联锁',
    14: '事故紧急切断联锁',
  },

  // 电解工艺（氯碱）
  electrolysisProcess: {
    1: '电解槽内液位',
    2: '流量',
    3: '压力',
    4: '电流',
    5: '电压',
    6: '原料中铵含量',
    7: '氯气杂质含量',
    8: '可燃气体浓度',
    9: '有毒有害气体浓度',
    10: '电解槽温度联锁',
    11: '压力联锁',
    12: '流量联锁',
    13: '供电联锁',
    14: '事故紧急切断联锁',
  },

  // 氯化工艺
  chlorinationProcess: {
    1: '釜内温度',
    2: '压力',
    3: '搅拌速度',
    4: '反应物配比',
    5: '氯化剂流量',
    6: '冷却介质温度',
    7: '冷却介质压力',
    8: '氯气杂质含量',
    9: '有毒有害气体浓度',
    10: '反应釜温度联锁',
    11: '压力联锁',
    12: '流量配比联锁',
    13: '事故紧急切断联锁',
  },

  // 硝化工艺
  nitrificationProcess: {
    1: '硝化反应釜内温度',
    2: '硝化剂流量',
    3: '精馏分离系统温度',
    4: '搅拌速率',
    5: '冷却水流量',
    6: 'PH值',
    7: '硝化产物中杂质含量',
    8: '塔釜杂质含量',
    9: '有毒有害气体浓度',
    10: '反应釜温度联锁',
    11: '压力联锁',
    12: '流量配比联锁',
    13: '事故紧急切断联锁',
  },

  // 合成氨工艺
  syntheticAmmoniaProcess: {
    1: '反应温度',
    2: '反应压力',
    3: '物料液位',
    4: '物料比例',
    5: '物料流量',
    6: '压缩机温度',
    7: '压缩机入口分离器液位',
    8: '压缩机压力',
    9: '可燃气体浓度',
    10: '有毒气体浓度',
    11: '温度联锁',
    12: '压力联锁',
    13: '物料比例联锁',
    14: '压缩机的温度联锁',
    15: '压缩机入口分离器液位联锁',
    16: '压缩机的压力联锁',
    17: '紧急联锁切断',
  },

  // 裂解（裂化）工艺
  pyrolysisProcess: {
    1: '裂解炉进料压力',
    2: '裂解炉进料流量',
    3: '裂解炉温度',
    4: '引风机电流',
    5: '燃料油进料流量',
    6: '稀释蒸汽比',
    7: '稀释蒸汽压力',
    8: '燃料油压力',
    9: '可燃气体浓度',
    10: '有毒气体浓度',
    11: '裂解炉进料压力联锁',
    12: '裂解炉进料流量联锁',
    13: '裂解炉温度联锁',
    14: '紧急联锁切断',
  },

  // 氟化工艺
  fluorinationProcess: {
    1: '反应釜内温度',
    2: '反应釜内压力',
    3: '反应釜搅拌速率',
    4: '氟化物流量',
    5: '助剂流量',
    6: '反应物配料比',
    7: '氟化物浓度',
    8: '可燃气体浓度',
    9: '有毒气体浓度',
    10: '反应釜内温度联锁',
    11: '压力联锁',
    12: '紧急冷却系统联锁',
  },

  // 加氢工艺
  hydrogenationProcess: {
    1: '加氢反应釜或催化剂床层温度',
    2: '加氢反应釜或催化剂床层压力',
    3: '反应物质配料比',
    4: '循环氢压缩机状态',
    5: '加氢反应釜内搅拌速率',
    6: '氢气流量',
    7: '加氢反应尾气成分',
    8: '系统氧含量',
    9: '冷却水流量',
    10: '氢气浓度',
    11: '其他可燃气体浓度',
    12: '反应温度联锁',
    13: '压力联锁',
    14: '反应物料比例联锁',
    15: '循环氢压缩机停机联锁',
    16: '紧急联锁切断',
  },

  // 重氮化工艺
  weightDiazotizationProcess: {
    1: '反应釜温度',
    2: '压力',
    3: '反应物料配比',
    4: '后处理单元温度',
    5: '反应釜PH值',
    6: '反应釜搅拌速率',
    7: '亚硝酸钠流量',
    8: '可燃气体浓度',
    9: '有毒气体浓度',
    10: '反应釜温度联锁',
    11: '反应釜压力联锁',
    12: '物料比例联锁',
    13: '后处理单元温度联锁',
    14: '惰性气体保护联锁',
    15: '紧急联锁切断',
  },
  // 氧化工艺
  oxidationProcess: {
    1: '反应釜温度',
    2: '压力',
    3: '反应物料配比',
    4: '反应釜搅拌速率',
    5: '氧化剂流量',
    6: '过氧化物含量',
    7: '可燃气体浓度',
    8: '有毒气体浓度',
    9: '反应釜温度联锁',
    10: '压力联锁',
    11: '物料配比联锁',
    12: '紧急联锁切断',
    13: '紧急动力切断联锁',
    14: '紧急断料联锁',
    15: '紧急冷却联锁',
    16: '紧急送入惰性气体联锁',
    17: '气相氧含量联锁',
  },

  // 过氧化工艺
  peroxidationProcess: {
    1: '反应釜温度',
    2: '反应釜压力',
    3: '（过）氧化剂流量',
    4: '反应物料配比',
    5: '气相氧含量',
    6: '反应釜PH',
    7: '反应釜搅拌速率',
    8: '过氧化物浓度',
    9: '可燃气体浓度',
    10: '有毒气体浓度',
    11: '反应釜温度联锁',
    12: '压力联锁',
    13: '反应物料配比联锁',
    14: '紧急动力切断联锁',
    15: '紧急断料联锁',
    16: '紧急冷却联锁',
    17: '紧急送入惰性气体联锁',
    18: '气相氧含量联锁',
  },

  // 氨基化工艺
  aminationProcess: {
    1: '反应釜温度',
    2: '反应釜压力',
    3: '反应物料配比',
    4: '物料流量',
    5: '气相氧含量',
    6: '反应釜搅拌速率',
    7: '可燃气体浓度',
    8: '有毒气体浓度',
    9: '反应釜温度联锁',
    10: '压力联锁',
    11: '反应物料配比联锁',
    12: '紧急冷却联锁',
    13: '气相氧含量监控联锁紧急送入惰性气体联锁',
    14: '气相氧含量联锁',
  },

  // 磺化工艺
  sulfonationProcess: {
    1: '反应釜温度',
    2: '磺化剂流量',
    3: '冷却水流量',
    4: '反应釜搅拌速率',
    5: '三氧化硫气体',
    6: '可燃气体浓度',
    7: '有毒气体浓度',
    8: '反应釜温度联锁',
    9: '反应釜搅拌联锁',
    10: '紧急冷却联锁',
    11: '紧急停车联锁',
  },

  // 聚合工艺
  polymerizationProcess: {
    1: '反应釜温度',
    2: '反应釜压力',
    3: '反应釜搅拌速率',
    4: '引发剂流量',
    5: '冷却水流量',
    6: '料仓静电',
    7: '可燃气体浓度',
    8: '有毒气体浓度',
    9: '反应釜温度联锁',
    10: '反应釜压力联锁',
    11: '紧急冷却联锁',
    12: '紧急切断联锁',
    13: '紧急加入反应终止剂联锁',
    14: '搅拌稳定联锁联锁',
  },

  // 烷基化工艺
  alkylationProcess: {
    1: '反应釜温度',
    2: '反应釜压力',
    3: '反应釜搅拌速率',
    4: '反应物料配比',
    5: '反应物料流量',
    6: '可燃气体浓度',
    7: '有毒气体浓度',
    8: '反应釜温度联锁',
    9: '反应釜压力联锁',
    10: '反应物料紧急切断联锁',
    11: '紧急冷却联锁',
  },

  // 新型煤化工工艺
  newCoalificationProcess: {
    1: '反应器温度',
    2: '反应器压力',
    3: '进料介质温度',
    4: '进料介质压力',
    5: '进料介质流量',
    6: '外取热器蒸汽温度',
    7: '外取热器蒸汽压力',
    8: 'H2/CO比',
    9: 'NO/O2比',
    10: 'NO/醇比',
    11: '反应物料比例',
    12: '反应物料料位',
    13: '液位',
    14: '氧含量',
    15: '风压',
    16: '风温',
    17: '烟气压力',
    18: '烟气温度',
    19: '压降',
    20: 'H2含量',
    21: 'H2S含量',
    22: 'CO2含量',
    23: '可燃气体浓度',
    24: '有毒气体浓度',
    25: '反应器温度联锁',
    26: '反应器压力联锁',
    27: '进料介质流量联锁',
    28: '反应系统紧急切断进料联锁',
    29: '料位控制联锁',
    30: '液位控制联锁',
    31: 'H2/CO比例联锁',
    32: 'NO/O2比例联锁',
    33: '外取热器蒸汽热水泵联锁',
    34: '主风流量联锁',
    35: '紧急冷却联锁',
  },

  // 电石生产工艺
  calciumCarbideProductionProcess: {
    1: '炉气压力',
    2: '料仓料位',
    3: '炉气组分',
    4: '氢含量',
    5: '炉气温度',
    6: '电极压放量',
    7: '一次电流',
    8: '一次电压',
    9: '电极电流',
    10: '电极电压',
    11: '有功功率',
    12: '冷却水温度',
    13: '冷却水压力',
    14: '液压箱油位',
    15: '液压箱温度',
    16: '变压器温度',
    17: '净化过滤器入口温度',
    18: '可燃气体浓度',
    19: '有毒气体浓度',
    20: '炉气压力联锁',
    21: '炉气组分联锁',
    22: '料仓超料位联锁',
  },

  // 偶氮化工艺
  diazotizationProcess: {
    1: '反应釜温度',
    2: '反应釜压力',
    3: '反应釜PH值',
    4: '配料比',
    5: '后处理单元温度',
    6: '反应釜内搅拌速率',
    7: '肼流量',
    8: '反应釜液位',
    9: '可燃气体浓度',
    10: '有毒气体浓度',
    11: '反应釜温度联锁',
    12: '反应釜压力联锁',
    13: '反应物料比例联锁',
    14: '紧急冷却联锁',
    15: '紧急停车联锁',
    16: '后处理单元温度联锁',
    17: '惰性气体保护联锁',
  },

  //  重大危险等级
  majorHazardLevel: {
    1: '一级',
    2: '二级',
    3: '三级',
    4: '四级',
  },
  //  重大危险等级
  majorHazardNature: {
    1: '易燃',
    2: '有毒',
    3: '兼有易燃有毒',
  },
  //  危险等级
  riskLevel: {
    1: '重大风险',
    2: '较大风险',
    3: '一般风险',
    4: '低风险',
  },
  //  危险等级
  twoThreeType: {
    1: '安全风险分级管控清单',
    2: '危险有害因素排查清单',
    3: '承诺卡',
    4: '应急卡',
    5: '应知卡',
  },
  noticeType: {
    1: '公告',
    2: '行业动态发布',
    3: '文件通知',
    4: '园区介绍',
  },

  // 出入类型
  comeGoType: {
    1: '入',
    2: '出',
  },

  // 出入类型
  personType: {
    1: '员工',
    2: '临时员工',
    3: '外协人员',
  },

  // 性别
  sexType: {
    1: '男',
    2: '女',
  },

  // 性别
  personCardType: {
    1: '员工卡',
    2: '临时卡',
  },

//  告警类型
  alarmType: {
    1: '人员定位警告',
    2: '电子围栏警告',
  },
  //  经营状态
  operatingStatus: {
    1: '营业',
    2: '停业',
    3: '筹建',
    4: '关闭',
    5: '破产',
    99: '其他',
  },

 //经济类型
  ecoType:{
    1: '股份制',
    2: '外商投资',
    3: '港澳台投资',
    4: '私营经济',
    5: '集体经济',
    6: '个体经济',
    7: '国有经济',
    8: '联营经济',
    99: '其他',
  },
  //企业规模
  entprScale:{
    1:'大型',
    2:'中型',
    3:'小型',
  },
  //单元类型
  unitType:{
    1:'生产单元',
    2:'存储单元'
},
  //  经营状态
  reviewStatus: {
    1: '待审核',
    2: '审核中',
    3: '审核不通过',
    4: '审核通过',
  },
  // 周边环境类型
  envrType:{
    1: '住宅区',
    2: '生产单位',
    3: '机关团体',
    4: '公共场所',
    5: '交通要道',
    99: '其他',
  },

  // 周边环境方位
  envrDirection:{
    1: '东',
    2: '西',
    3: '南',
    4: '北',
    5: '东南',
    6: '西南',
    7: '东北',
    8: '西北',
  },

  // 建筑结构
  buildStruct:{
    1: '混合结构',
    2: '框架结构',
    3: '框架剪力墙结构',
    4: '剪力墙结构',
    5: '框筒结构',
    6: '筒中筒结构',
    7: '钢架网、悬索结构',
    99: '其他',
  },

  // 建筑结构
  productType:{
    1: '生产原料',
    2: '中间产品',
    3: '最终产品',
  },
};

export interface MapItem {
  label: string;
  value: any;
}

@Pipe({
  name: 'map',
})
export class MapPipe implements PipeTransform {
  private datePipe: DatePipe = new DatePipe('en-US');
  private mapObj = MapSet;

  static transformMapToArray(data: any, mapKeyType: MapKeyType = MapKeyType.Number): MapItem[] {
    return Object.keys(data || {}).map(key => {
      let value: any;
      switch (mapKeyType) {
        case MapKeyType.Number:
          value = Number(key);
          break;
        case MapKeyType.Boolean:
          value = key === 'true';
          break;
        case MapKeyType.String:
        default:
          value = key;
          break;
      }
      return { value, label: data[key] };
    });
  }

  transform(value: any, arg?: any): any {
    if (arg === undefined) {
      return value;
    }
    let type: string = arg;
    let param = '';

    if (arg.indexOf(':') !== -1) {
      type = arg.substring(0, arg.indexOf(':'));
      param = arg.substring(arg.indexOf(':') + 1, arg.length);
    }

    switch (type) {
      case 'date':
        return this.datePipe.transform(value, param);
      default:
        return (this.mapObj[type] ? this.mapObj[type][value] : '');
    }
  }
}
